ЦентраАдминистрированияСервер/src/Catalogs/ВнешниеПользователи/ВнешниеПользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеПользователи</name>
  <tabularSections>
    <name>ПрофилиДоступа</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ИнформационныеБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ПрофилиДоступа</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокИнформационныхБаз</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ИнформационныеБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>Недействителен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВходВПрограммуРазрешен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СменаПароляПриВходе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрещеноИзменятьПароль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьВСпискеВыбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПользователяИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СохраняемоеЗначениеПароля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЦентраАдминистрированияСервер/src/Catalogs/ВнешниеПользователи/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура СписокИнформационныхБазПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИдентификаторПользователяИБ = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокИнформационныхБазПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("ИнформационнаяБаза", Элемент.ТекущиеДанные.ИнформационнаяБаза);
		Элементы.ПрофилиДоступа.ОтборСтрок = ПараметрыОтбора;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПользователей(Команда)
	
	ДлительнаяОперация = ОбновитьПользователейНаСервере(УникальныйИдентификатор);
//	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Неопределено, ПараметрыОжидания);
	
	//ПоказатьПредупреждение(,"Операция была выполнена");
КонецПроцедуры

&НаСервере
Функция ОбновитьПользователейНаСервере(УникальныйИдентификатор)
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("Наименование", Объект.Наименование);
	СтруктураДанных.Вставить("СписокИнформационныхБаз", Объект.СписокИнформационныхБаз.Выгрузить());
	СтруктураДанных.Вставить("ПрофилиДоступа", Объект.ПрофилиДоступа.Выгрузить());
	
	//ЗагрузитьПользователейНаСервере(ВыбранноеЗначение);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Нстр("ru = 'Обновление пользователей.'");
	//ВыбранноеЗначение = МассивБаз	
	ПараметрыПроцедуры = Новый Структура("Объект", СтруктураДанных);
	Результат = ДлительныеОперации.ВыполнитьВФоне(
	"РаботаСПользователями.ОбновлениеПользователей", ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Возврат  Результат;
	
КонецФункции

&НаКлиенте
Процедура ПрофилиДоступаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элемент.ТекущиеДанные.ИнформационнаяБаза = Элементы.СписокИнформационныхБаз.ТекущиеДанные.ИнформационнаяБаза;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для каждого СтрокаБаза из Объект.СписокИнформационныхБаз цикл
		СтрокаБаза.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для каждого СтрокаБаза из Объект.СписокИнформационныхБаз цикл
		СтрокаБаза.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокИнформационныхБазПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если не ОтменаРедактирования И НЕ Элемент.ТекущийЭлемент.Имя  = "СписокИнформационныхБазОтметка" Тогда
		Элемент.ТекущиеДанные.Отметка = Истина;
	КонецЕсли;
	
КонецПроцедуры
